salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен

money_capital = 0  # Подушка безопасности

for _ in range(months):
    money_capital += spend - salary     # Расчёт необходимых финансов на покрытие расходов
    spend += spend * increase           # Увеличение ежемесяных трат за счёт роста цен

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", round(money_capital, 2))
